Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.WarningInFamilyDismissed
A warning in family "[Name]" was dismissed. Please review warning information to determine if any changes are necessary\nWarning Information:\n"[Text]"

Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.ValueOutOfRange
Value is out of range ! Please enter a number between [Value] and [Value].

Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.UnspecifiedError
Revit has experienced an unexpected error.  The operation has been cancelled to protect your project from corruption.

Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.UnresolvableErrorInFamilyWarn
An error occurred in family "[Name]" that cannot be automatically resolved.\nError Information:\n"[Text]"

Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.UnresolvableErrorInFamily
An error occurred in family "[Name]" that cannot be automatically resolved.\nError Information:\n"[Text]"

Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.TransactionFailedWarn
[Description]

Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.TransactionFailed
[Description]

Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.SeriousElementReferenceCorruption
Element references are seriously corrupt.

Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.ParameterValueNotInRange
The value for [Parameter Name] must be between [Value] and [Value].

Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.NoRelatedWarnings
Document doesn't contain any warnings related to these elements.

Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.NameNotUnique
The name entered is already in use. Enter a unique name.

Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.NameIsEmpty
Name is empty

Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.NameInUse
The name "[Name]" is already in use.

Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.InvalidValue
Invalid value.

Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.InvalidInputWarn
Invalid Input

Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.InvalidInput
Invalid Input

Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.InternalProblemsParameter
Parameter cannot be changed due to internal problems.

Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.InaccuracyDetected
A geometric inaccuracy was found in the element.

Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.GenericWarning
A generic error has occurred.

Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.GenericNonFatalError
A serious error has occurred. It is strongly recommended that you use Save As to save your work in a new file before continuing.

Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.GenericFatalError
A fatal error has occurred.  The application will be terminated.  You will be given the opportunity to save
recovery files for all of your changed projects.\tWould you like to save a recovery file for [Project Name]?

Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.GenericErrorNone
None.

Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.GenericError
Error.

Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.GenericCorruption
A generic error has occurred.

Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.FamilySeparationTestingError
Family separation testing error (internal).

Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.FailedToReadLine
Failed to read line.

Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.FailedToOpenFile
Failed to open file.

Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.ErrorResolved
Error "[Text]" was automatically resolved by "[Resolution]"

Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.ErrorInSymbolFamilyResolved
An error occurred in family "[Name]" and was automatically resolved, but may require review by the family creator.\nError Information:\n"[Text]"\nError Resolution: [Resolution]

Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.ErrorInFamilyResolved
An error occurred in family "[Name]" and was automatically resolved. Please review changes made to the family.\nError Information:\n"[Text]"\nError Resolution: [Resolution]

Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.EnterValueBetween
Please enter a value between [Value] and [Value].

Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.EnterValidRealGreaterThan
Enter a number greater than [Value].

Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.DuplicateValue
Elements have duplicate '[Value]' values.

Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.CoreElemTestingError
Core element testing error (internal).

Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.ConvertingOldAxisToNormal
This operation will convert the existing axis of revolution to a normal line.

Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.ContentDocTreeCorruption
Problems with the Content Doc Tree structure - e.g. orphaned Content Docs, Families w/o docs, missing Owner Fam, what-not

Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.CharactersNotAllowed
Name cannot contain any of the following characters:\n[{}[]|;<>?`~]\nor any of the non-printable characters.

Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.CannotSetParameter
Cant set parameter

Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.CannotFixProblem
Failed to fix problem. Action has to be cancelled.

Autodesk.Revit.DB.BuiltInFailures.GeneralFailures
Failures about GeneralFailures.